Revit 2026 API

# FillPattern(FillPattern) Constructor

---

Constructs a new copy of the input FillPattern object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FillPattern(
	FillPattern other
)
```
```vb
Public Sub New (
	other As FillPattern
)
```
```cpp
public:
FillPattern(
	FillPattern^ other
)
```
```fsharp
new :
        other : FillPattern -> FillPattern
```

#### Parameters

other FillPattern

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FillPattern Class

FillPattern Overload

Autodesk.Revit.DB Namespace